app/views/users/show.html.erb

  <div class="col-md-8">
    <% if @user.blueprints.any? %>
---
SELECT  1 AS one FROM "blueprints" WHERE "blueprints"."user_id" = ? LIMIT 1  [["user_id", 762146111]]