app/views/shared/_user_info.html.erb

<span><%= link_to "view my profile", current_user %></span>
<span><%= pluralize(current_user.blueprints.count, "micropost") %></span>
---
SELECT COUNT(*) FROM "blueprints" WHERE "blueprints"."user_id" = ?  [["user_id", 101]]