app/controllers/blueprints_controller.rb

INSERT INTO "blueprints" ("coursecode", "minStudents", "maxStudents", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["coursecode", "1234"], ["minStudents", 231], ["maxStudents", 43], ["user_id", 101], ["created_at", "2015-12-01 04:04:10.137555"], ["updated_at", "2015-12-01 04:04:10.137555"]]
---
  def create
    @blueprint = current_user.blueprints.build(blueprint_params)
    if @blueprint.save