app/controllers/users_controller.rb

SELECT  "blueprints".* FROM "blueprints" WHERE "blueprints"."user_id" = ?  ORDER BY "blueprints"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 2]]
SELECT COUNT(*) FROM "blueprints" WHERE "blueprints"."user_id" = ?  [["user_id", 2]]
---
  def show
    @user = User.find(params[:id])
    @blueprints = @user.blueprints.paginate(page: params[:page])